Nithin3200/Project_ECG/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WDT_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_WDT_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_WDT_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_WDT_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_WDT_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_23 (number 8), ECGMUX1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ECGMUX1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ECGMUX1_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ECGMUX1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ECGMUX1_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ECGMUX1_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO4_18 (number 10), DEC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEC_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DEC_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DEC_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEC_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEC_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO3_15 (number 11), Port_Exp
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Port_Exp_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Port_Exp_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Port_Exp_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Port_Exp_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Port_Exp_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_5 (number 12), SW_ERR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_ERR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_ERR_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SW_ERR_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW_ERR_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW_ERR_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO3_14 (number 13), Incr
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Incr_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Incr_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Incr_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Incr_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Incr_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_27 (number 130), EGAIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EGAINA_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EGAINA_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EGAINA_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EGAINA_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EGAINA_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO3_12 (number 37), EGAIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EGAINB_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EGAINB_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EGAINB_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EGAINB_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EGAINB_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO2_7 (number 29), Enter
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Enter_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Enter_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Enter_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Enter_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Enter_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO2_11 (number 43), QRS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QRS_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QRS_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_QRS_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QRS_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QRS_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO2_12 (number 45), DSCHG
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSCHG_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSCHG_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DSCHG_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSCHG_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSCHG_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

