Nithin3200/Project_ECG/board/pin_mux.h
/*! @name PIO3_20 (number 46), KeyBuff
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KeyBuff_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KeyBuff_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KeyBuff_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KeyBuff_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KeyBuff_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO4_22 (number 47), Battfull
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Battfull_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Battfull_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Battfull_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Battfull_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Battfull_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_11 (number 51), Charge
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Charge_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Charge_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Charge_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Charge_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Charge_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_31 (number 55), AED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AED_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AED_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_AED_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AED_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AED_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO1_0 (number 56), Discharge
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Discharged_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Discharged_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Discharged_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Discharged_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Discharged_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO3_18 (number 68), Pacer
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Pacer_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Pacer_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Pacer_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Pacer_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Pacer_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO3_13 (number 75), Sync
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Sync_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Sync_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Sync_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Sync_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Sync_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_22 (number 89), QRSTrig
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QRSTrig_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QRSTrig_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_QRSTrig_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QRSTrig_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QRSTrig_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_18 (number 90), HVRST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HVRST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_HVRST_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_HVRST_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HVRST_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HVRST_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_19 (number 93), QRSMux2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QRSMux2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QRSMux2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_QRSMux2_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QRSMux2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QRSMux2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                         /* @} */

