Nithin3200/Project_ECG/board/pin_mux.h
/*! @name PIO2_20 (number 95), Event
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Event_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Event_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Event_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Event_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Event_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO4_31 (number 114), CPR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CPR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CPR_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_CPR_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CPR_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CPR_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO2_26 (number 124), QRSMux1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QRSMux1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QRSMux1_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_QRSMux1_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QRSMux1_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QRSMux1_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO4_4 (number 147), PacerEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PacerEN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PacerEN_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PacerEN_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PacerEN_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PacerEN_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO4_5 (number 154), Print
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Print_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Print_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Print_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Print_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Print_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO5_10 (number 168), NIBP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NIBP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NIBP_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NIBP_PORT 5U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_NIBP_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NIBP_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO3_3 (number 169), RENReset
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RENReset_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RENReset_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_RENReset_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RENReset_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RENReset_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_4 (number 172), AudioEn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AudioEn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AudioEn_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_AudioEn_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AudioEn_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AudioEn_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO5_9 (number 179), Monitor
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Monitor_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Monitor_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Monitor_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Monitor_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Monitor_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO4_10 (number 181), Mute
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Mute_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Mute_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Mute_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Mute_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Mute_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO4_13 (number 190), Manual
  @{ */

