Nithin3200/Project_ECG/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Manual_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Manual_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Manual_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Manual_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Manual_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_0 (number 196), PWR_Int
  @{ */
#define BOARD_INITPINS_PWR_Int_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWR_Int_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWR_Int_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO3_10 (number 199), PWRHld
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PWRHld_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PWRHld_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PWRHld_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWRHld_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWRHld_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO5_2 (number 202), ECG_Type
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ECG_Type_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ECG_Type_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ECG_Type_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ECG_Type_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ECG_Type_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO4_6 (number 161), Cartridge
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Cartridge_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Cartridge_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Cartridge_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Cartridge_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Cartridge_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO3_2 (number 164), Print_Rst
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Print_Rst_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Print_Rst_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_Print_Rst_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Print_Rst_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Print_Rst_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_29 (number 167), PWR_IN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PWR_IN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PWR_IN_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PWR_IN_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWR_IN_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWR_IN_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO3_19 (number 44), LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED1_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO3_30 (number 116), LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED2_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED2_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED2_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED2_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO3_31 (number 123), LCD_PWR
  @{ */
#define BOARD_INITPINS_LCD_PWR_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_PWR_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_PWR_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_3 (number 120), ENCA
  @{ */
#define BOARD_INITPINS_ENCA_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ENCA_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ENCA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_30 (number 200), ENCB
  @{ */
#define BOARD_INITPINS_ENCB_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ENCB_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ENCB_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO3_11 (number 208), mclk
  @{ */
#define BOARD_INITPINS_mclk_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_mclk_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_mclk_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO4_7 (number 166), USB0PWR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USB0PWR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_USB0PWR_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_USB0PWR_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USB0PWR_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USB0PWR_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
